## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

### Ans:--

In [3]:
import pandas as pd

data=[4,8,15,16,23]
my_series=pd.Series(data)
print(my_series)

0     4
1     8
2    15
3    16
4    23
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
### Ans:--

In [4]:
import pandas as pd

list=[1,2,3,4,5,6,7,8,9,10]
series=pd.Series(list)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Create a Pandas DataFrame that contains the following data:
### Ans:--

In [45]:
df1=pd.read_csv('data1.csv')
df1.head()

     name  age  gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
### Ans:--

abular data structure with labeled axes (rows and columns). It is similar to a spreadsheet or SQL table, where data is organized in rows and columns. Each column in a DataFrame can be considered as a Pandas Series.

#### Differences between DataFrame and Series:

#### Dimensions:

- Series: A Pandas Series is a one-dimensional labeled array that can hold any data type.
- DataFrame: A Pandas DataFrame is a two-dimensional table with rows and columns.

#### Data Structure:

- Series: A Series is essentially a single column of data with an associated index.
- DataFrame: A DataFrame is a collection of Series where each column of the DataFrame is a Series.

#### Creation:

- Series: Created using the pd.Series() constructor or by converting a list or NumPy array.
- DataFrame: Created using the pd.DataFrame() constructor or by converting a dictionary, NumPy array, or another DataFrame.

#### Example:

In [36]:
import pandas as pd


series_data = pd.Series([10, 20, 30, 40], name="MySeries")


data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data)


print("Pandas Series:")
print(series_data)
print("\nPandas DataFrame:")
print(df)

Pandas Series:
0    10
1    20
2    30
3    40
Name: MySeries, dtype: int64

Pandas DataFrame:
      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?
### Ans:--

Pandas provides a wide range of functions for manipulating data in a DataFrame. Here are some common functions and methods along with examples:

#### head() and tail():

- Description: Returns the first (head) or last (tail) n rows of a DataFrame.
#### Example:

In [13]:
df.head(1)

    Name  Age      City
0  Alice   25  New York

In [14]:
df.tail(1)

    Name  Age     City
3  David   28  Chicago

#### describe():

Description: Generates descriptive statistics of the DataFrame, including count, mean, std, min, and max.
#### Example:

In [15]:
df.describe()

             Age
count   4.000000
mean   29.500000
std     4.203173
min    25.000000
25%    27.250000
50%    29.000000
75%    31.250000
max    35.000000

#### info():

Description: Provides a concise summary of the DataFrame, including data types and non-null counts.
#### Example:

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

### value_counts():

Description: Returns a Series containing counts of unique values in a specified column.
### Example:

In [17]:
df.value_counts()

Name     Age  City
Alice    25   New York         1
Bob      30   San Francisco    1
Charlie  35   Los Angeles      1
David    28   Chicago          1
Name: count, dtype: int64

#### groupby():

Description: Groups the DataFrame by a specified column and applies an aggregation function.
#### Example:

##### Grouping by 'City' and calculating the average age in each city
df.groupby('City')['Age'].mean()

#### sort_values():

Description: Sorts the DataFrame by one or more columns.
#### Example:

In [26]:
df.sort_values(by="Age",ascending=True)

      Name  Age           City
0    Alice   25       New York
3    David   28        Chicago
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

#### drop():

Description: Removes specified rows or columns from the DataFrame.
#### Example:

In [34]:
df.drop(columns='Age',inplace=True) ## inplace true means permanently delete from original data

####  fillna():

Description: Fills missing values in the DataFrame with a specified value or using a specified method.
#### Example:

In [38]:
df['Age'].fillna(df['Age'].mean())

0    25
1    30
2    35
3    28
Name: Age, dtype: int64

#### apply():

Description: Applies a function along the axis of the DataFrame (either rows or columns).
#### Example:

In [39]:
df['Age'].apply(lambda x: x**2)

0     625
1     900
2    1225
3     784
Name: Age, dtype: int64

#### merge():

Description: Combines two DataFrames based on a common column.
#### Example:

merged_df = pd.merge(df1, df, on='name')

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
### Ans:--
Series,DataFrame and pannel all are mutuable in nature


## Q7. Create a DataFrame using multiple Series. Explain with an example.
### Ans:--

In [2]:
import pandas as pd


name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 35])
city_series = pd.Series(['New York', 'San Francisco', 'Los Angeles'])


data = {'Name': name_series, 'Age': age_series, 'City': city_series}


df = pd.DataFrame(data)


print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

- In this example, we have three Series (name_series, age_series, and city_series) representing the name, age, and city of individuals. We then create a dictionary (data) where the keys are the column names ('Name', 'Age', 'City') and the values are the corresponding Series. Finally, we use the pd.DataFrame() constructor to create a DataFrame (df) from the dictionary.